app/controllers/card_types_controller.rb

	def index
		@card_types = CardType.all
---
SELECT "card_types".* FROM "card_types"

	def create
		@card_type = CardType.new(card_type_params)

		if @card_type.save
---
INSERT INTO "card_types" ("created_at", "edition", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 28 Oct 2013 09:37:56 UTC +00:00], ["edition", "Star Wars 2013"], ["name", "YODA"], ["updated_at", Mon, 28 Oct 2013 09:37:56 UTC +00:00]]

	def show
		@card_type = CardType.find(params[:id])
---
SELECT "card_types".* FROM "card_types" WHERE "card_types"."id" = ? LIMIT 1  [["id", "1"]]

	def edit
		@card_type = CardType.find(params[:id])
---
SELECT "card_types".* FROM "card_types" WHERE "card_types"."id" = ? LIMIT 1  [["id", "1"]]