app/controllers/sales_controller.rb

def index
	@sale = Sale.all
---
SELECT "sales".* FROM "sales"

def create
  @card = Card.find(params[:card_id])
  @sale = @card.build_sale(params[:sale].permit(:starting_price))
	if @sale.save
---
INSERT INTO "sales" ("created_at", "starting_price", "updated_at") VALUES (?, ?, ?)  [["created_at", Mon, 28 Oct 2013 10:44:07 UTC +00:00], ["starting_price", 1.0], ["updated_at", Mon, 28 Oct 2013 10:44:07 UTC +00:00]]

def show
	@sale = Sale.find (params[:id])
---
SELECT "sales".* FROM "sales" WHERE "sales"."id" = ? LIMIT 1  [["id", "2"]]

def edit
	@sale = Sale.find (params[:id])
---
SELECT "sales".* FROM "sales" WHERE "sales"."id" = ? LIMIT 1  [["id", "1"]]

def update
	@sale = Sale.find (params[:id])
	if @sale.update (params[:sale].permit(:starting_price))
---
SELECT "sales".* FROM "sales" WHERE "sales"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "sales" SET "starting_price" = ?, "updated_at" = ? WHERE "sales"."id" = 1  [["starting_price", 3.0], ["updated_at", Mon, 28 Oct 2013 11:13:56 UTC +00:00]]