app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "encrypted_password", "salt", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save